#include <unistd.h>

#include <cassert>
#include <cstdio>
#include <cstdint>
#include <cstdlib>
#include <iostream>
#include <iomanip>
#include <map>
#include <string>
#include <vector>

/*
░─░━░│░┃░┄░┅░┆░┇░┈░┉░┊░┋░┌░┍░┎░┏░┐░┑░┒░┓░└░┕░┖░┗░┘░┙░┚░┛░├░┝░┞░┟░░
░░┠░┡░┢░┣░┤░┥░┦░┧░┨░┩░┪░┫░┬░┭░┮░┯░┰░┱░┲░┳░┴░┵░┶░┷░┸░┹░┺░┻░┼░┽░┾░┿░
░╀░╁░╂░╃░╄░╅░╆░╇░╈░╉░╊░╋░╌░╍░╎░╏░═░║░╒░╓░╔░╕░╖░╗░╘░╙░╚░╛░╜░╝░╞░╟░░
░░╠░╡░╢░╣░╤░╥░╦░╧░╨░╩░╪░╫░╬░╭░╮░╯░╰░╱░╲░╳░╴░╵░╶░╷░╸░╹░╺░╻░╼░╽░╾░╿░
░▀░▁░▂░▃░▄░▅░▆░▇░█░▉░▊░▋░▌░▍░▎░▏░▐░░░▒░▓░▔░▕░▖░▗░▘░▙░▚░▛░▜░▝░▞░▟░░
░░🬀░🬁░🬂░🬃░🬄░🬅░🬆░🬇░🬈░🬉░🬊░🬋░🬌░🬍░🬎░🬏░🬐░🬑░🬒░🬓░🬔░🬕░🬖░🬗░🬘░🬙░🬚░🬛░🬜░🬝░🬞░🬟░
░🬠░🬡░🬢░🬣░🬤░🬥░🬦░🬧░🬨░🬩░🬪░🬫░🬬░🬭░🬮░🬯░🬰░🬱░🬲░🬳░🬴░🬵░🬶░🬷░🬸░🬹░🬺░🬻░🬼░🬽░🬾░🬿░░
░░🭀░🭁░🭂░🭃░🭄░🭅░🭆░🭇░🭈░🭉░🭊░🭋░🭌░🭍░🭎░🭏░🭐░🭑░🭒░🭓░🭔░🭕░🭖░🭗░🭘░🭙░🭚░🭛░🭜░🭝░🭞░🭟░
░🭠░🭡░🭢░🭣░🭤░🭥░🭦░🭧░🭨░🭩░🭪░🭫░🭬░🭭░🭮░🭯░🭰░🭱░🭲░🭳░🭴░🭵░🭶░🭷░🭸░🭹░🭺░🭻░🭼░🭽░🭾░🭿░░
░░🮀░🮁░🮂░🮃░🮄░🮅░🮆░🮇░🮈░🮉░🮊░🮋░🮌░🮍░🮎░🮏░🮐░🮑░🮒░🮔░🮕░🮖░🮗░🮘░🮙░🮚░🮛░🮜░🮝░🮞░🮟░░░
░🮠░🮡░🮢░🮣░🮤░🮥░🮦░🮧░🮨░🮩░🮪░🮫░🮬░🮭░🮮░🮯░🮰░🮱░🮲░🮳░🮴░🮵░🮶░🮷░🮸░🮹░🮺░🮻░🮼░🮽░🮾░🮿░░
░░🯀░🯁░🯂░🯃░🯄░🯅░🯆░🯇░🯈░🯉░🯊░🯋░🯌░🯍░🯎░🯏░🯐░🯑░🯒░🯓░🯔░🯕░🯖░🯗░🯘░🯙░🯚░🯛░🯜░🯝░🯞░🯟░
░🯠░🯡░🯢░🯣░🯤░🯥░🯦░🯧░🯨░🯩░🯪░🯫░🯬░🯭░🯮░🯯░🯰░🯱░🯲░🯳░🯴░🯵░🯶░🯷░🯸░🯹░🯺░░░░░░░░░░░░
░░𜰀░𜰁░𜰂░𜰃░𜰄░𜰅░𜰆░𜰇░𜰈░𜰉░𜰊░𜰋░𜰌░𜰍░𜰎░𜰏░𜰐░𜰑░𜰒░𜰓░𜰔░𜰕░𜰖░𜰗░𜰘░𜰙░𜰚░𜰛░𜰜░𜰝░𜰞░𜰟░
░𜰠░𜰡░𜰢░𜰣░𜰤░𜰥░𜰦░𜰧░𜰨░𜰩░𜰪░𜰫░𜰬░𜰭░𜰮░𜰯░𜰰░𜰱░𜰲░𜰳░𜰴░𜰵░𜰶░𜰷░𜰸░𜰹░𜰺░𜰻░𜰼░𜰽░𜰾░𜰿░░
░░𜱀░𜱁░𜱂░𜱃░𜱄░𜱅░𜱆░𜱇░𜱈░𜱉░𜱊░𜱋░𜱌░𜱍░𜱎░𜱏░𜱐░𜱑░𜱒░𜱓░𜱔░𜱕░𜱖░𜱗░𜱘░𜱙░𜱚░𜱛░𜱜░𜱝░𜱞░𜱟░
░𜱠░𜱡░𜱢░𜱣░𜱤░𜱥░𜱦░𜱧░𜱨░𜱩░𜱪░𜱫░𜱬░𜱭░𜱮░𜱯░𜱰░𜱱░𜱲░𜱳░𜱴░𜱵░𜱶░𜱷░𜱸░𜱹░𜱺░𜱻░𜱼░𜱽░𜱾░𜱿░░
░░𜲀░𜲁░𜲂░𜲃░𜲄░𜲅░𜲆░𜲇░𜲈░𜲉░𜲊░𜲋░𜲌░𜲍░𜲎░𜲏░𜲐░𜲑░𜲒░𜲓░𜲔░𜲕░𜲖░𜲗░𜲘░𜲙░𜲚░𜲛░𜲜░𜲝░𜲞░𜲟░
░𜲠░𜲡░𜲢░𜲣░𜲤░𜲥░𜲦░𜲧░𜲨░𜲩░𜲪░𜲫░𜲬░𜲭░𜲮░𜲯░𜲰░𜲱░𜲲░𜲳░𜲴░𜲵░𜲶░𜲷░𜲸░𜲹░𜲺░𜲻░𜲼░𜲽░𜲾░𜲿░░
░░𜳀░𜳁░𜳂░𜳃░𜳄░𜳅░𜳆░𜳇░𜳈░𜳉░𜳊░𜳋░𜳌░𜳍░𜳎░𜳏░𜳐░𜳑░𜳒░𜳓░𜳔░𜳕░𜳖░𜳗░𜳘░𜳙░𜳚░𜳛░𜳜░𜳝░𜳞░𜳟░
░𜳠░𜳡░𜳢░𜳣░𜳤░𜳥░𜳦░𜳧░𜳨░𜳩░𜳪░𜳫░𜳬░𜳭░𜳮░𜳯░𜳰░𜳱░𜳲░𜳳░𜳴░𜳵░𜳶░𜳷░𜳸░𜳹░𜳺░𜳻░𜳼░░░░░░░░
░░𜴀░𜴁░𜴂░𜴃░𜴄░𜴅░𜴆░𜴇░𜴈░𜴉░𜴊░𜴋░𜴌░𜴍░𜴎░𜴏░𜴐░𜴑░𜴒░𜴓░𜴔░𜴕░𜴖░𜴗░𜴘░𜴙░𜴚░𜴛░𜴜░𜴝░𜴞░𜴟░
░𜴠░𜴡░𜴢░𜴣░𜴤░𜴥░𜴦░𜴧░𜴨░𜴩░𜴪░𜴫░𜴬░𜴭░𜴮░𜴯░𜴰░𜴱░𜴲░𜴳░𜴴░𜴵░𜴶░𜴷░𜴸░𜴹░𜴺░𜴻░𜴼░𜴽░𜴾░𜴿░░
░░𜵀░𜵁░𜵂░𜵃░𜵄░𜵅░𜵆░𜵇░𜵈░𜵉░𜵊░𜵋░𜵌░𜵍░𜵎░𜵏░𜵐░𜵑░𜵒░𜵓░𜵔░𜵕░𜵖░𜵗░𜵘░𜵙░𜵚░𜵛░𜵜░𜵝░𜵞░𜵟░
░𜵠░𜵡░𜵢░𜵣░𜵤░𜵥░𜵦░𜵧░𜵨░𜵩░𜵪░𜵫░𜵬░𜵭░𜵮░𜵯░𜵰░𜵱░𜵲░𜵳░𜵴░𜵵░𜵶░𜵷░𜵸░𜵹░𜵺░𜵻░𜵼░𜵽░𜵾░𜵿░░
░░𜶀░𜶁░𜶂░𜶃░𜶄░𜶅░𜶆░𜶇░𜶈░𜶉░𜶊░𜶋░𜶌░𜶍░𜶎░𜶏░𜶐░𜶑░𜶒░𜶓░𜶔░𜶕░𜶖░𜶗░𜶘░𜶙░𜶚░𜶛░𜶜░𜶝░𜶞░𜶟░
░𜶠░𜶡░𜶢░𜶣░𜶤░𜶥░𜶦░𜶧░𜶨░𜶩░𜶪░𜶫░𜶬░𜶭░𜶮░𜶯░𜶰░𜶱░𜶲░𜶳░𜶴░𜶵░𜶶░𜶷░𜶸░𜶹░𜶺░𜶻░𜶼░𜶽░𜶾░𜶿░░
░░𜷀░𜷁░𜷂░𜷃░𜷄░𜷅░𜷆░𜷇░𜷈░𜷉░𜷊░𜷋░𜷌░𜷍░𜷎░𜷏░𜷐░𜷑░𜷒░𜷓░𜷔░𜷕░𜷖░𜷗░𜷘░𜷙░𜷚░𜷛░𜷜░𜷝░𜷞░𜷟░
░𜷠░𜷡░𜷢░𜷣░𜷤░𜷥░𜷦░𜷧░𜷨░𜷩░𜷪░𜷫░𜷬░𜷭░𜷮░𜷯░𜷰░𜷱░𜷲░𜷳░𜷴░𜷵░𜷶░𜷷░𜷸░𜷹░𜷺░𜷻░𜷼░𜷽░𜷾░𜷿░░
░░𜸀░𜸁░𜸂░𜸃░𜸄░𜸅░𜸆░𜸇░𜸈░𜸉░𜸊░𜸋░𜸌░𜸍░𜸎░𜸏░𜸐░𜸑░𜸒░𜸓░𜸔░𜸕░𜸖░𜸗░𜸘░𜸙░𜸚░𜸛░𜸜░𜸝░𜸞░𜸟░
░𜸠░𜸡░𜸢░𜸣░𜸤░𜸥░𜸦░𜸧░𜸨░𜸩░𜸪░𜸫░𜸬░𜸭░𜸮░𜸯░𜸰░𜸱░𜸲░𜸳░𜸴░𜸵░𜸶░𜸷░𜸸░𜸹░𜸺░𜸻░𜸼░𜸽░𜸾░𜸿░░
░░𜹀░𜹁░𜹂░𜹃░𜹄░𜹅░𜹆░𜹇░𜹈░𜹉░𜹊░𜹋░𜹌░𜹍░𜹎░𜹏░𜹐░𜹑░𜹒░𜹓░𜹔░𜹕░𜹖░𜹗░𜹘░𜹙░𜹚░𜹛░𜹜░𜹝░𜹞░𜹟░
░𜹠░𜹡░𜹢░𜹣░𜹤░𜹥░𜹦░𜹧░𜹨░𜹩░𜹪░𜹫░𜹬░𜹭░𜹮░𜹯░𜹰░𜹱░𜹲░𜹳░𜹴░𜹵░𜹶░𜹷░𜹸░𜹹░𜹺░𜹻░𜹼░𜹽░𜹾░𜹿░░
░░𜺀░𜺁░𜺂░𜺃░𜺄░𜺅░𜺆░𜺇░𜺈░𜺉░𜺊░𜺋░𜺌░𜺍░𜺎░𜺏░𜺐░𜺑░𜺒░𜺓░𜺔░𜺕░𜺖░𜺗░𜺘░𜺙░𜺚░𜺛░𜺜░𜺝░𜺞░𜺟░
░𜺠░𜺡░𜺢░𜺣░𜺤░𜺥░𜺦░𜺧░𜺨░𜺩░𜺪░𜺫░𜺬░𜺭░𜺮░𜺯░𜺰░𜺱░𜺲░𜺳░𜺺░𜺻░𜺼░𜺽░𜺾░𜺿░
*/


using Codepoint = uint32_t;

struct Glyph {
    static constexpr int kWidth = 8;
    static constexpr int kHeight = 8;

    uint64_t bitmap(int row = 0) const {
        uint64_t r = 0;
        for (int i = 0; i < 64 / kWidth; ++i) {
            int j = i + row;
            if (0 <= j && j < kHeight) {
                r |= uint64_t(blob_[j]) << (i * kWidth);
            }
        }
        return r;
    }
    void hflip() {
        for (int i = 0; i < kHeight; ++i) {
            int x = blob_[i];
            x = ((x >> 1) & 0x5555555555555555) | ((x & 0x5555555555555555) << 1);
            x = ((x >> 2) & 0x3333333333333333) | ((x & 0x3333333333333333) << 2);
            x = ((x >> 4) & 0x0f0f0f0f0f0f0f0f) | ((x & 0x0f0f0f0f0f0f0f0f) << 4);
            blob_[i] = x;
        }
    }

    uint8_t blob_[kHeight];
};

struct DecoderBase {
    // TODO: whatever
};

template <size_t W, size_t H>
struct Decoder : public DecoderBase {
    Decoder(char const* ptr) {
        while (*ptr != '\0') {
            uint8_t byte = *ptr;
            if (!is_ext_byte(byte)) {
                glyphs_.push_back(ptr);
            }
            ptr++;
        }
        context_height_ = 0;
        int context_size;
        // TODO: determine context_width_;
        do {
            context_height_++;
            context_size = context_width_ * context_height_;
        } while ((glyphs_.size() >> context_size) > 1);
        context_mask_ = ~(~uint64_t(1) << (context_width_ - 1));
    }

    void decode(std::string& out, uint64_t bitmap) const {
        for (int x = 0; x < 8; x += W) {
            int j = 0;
            uint64_t mask = context_mask_;
            int shift = 0;
            for (int y = 0; y < context_height_; ++y) {
                j |= (bitmap >> shift) & mask;
                mask <<= context_width_;
                shift += 8 - context_width_;
            }
            bitmap >>= W;
            assert(0 <= j && j < int(glyphs_.size()));
            char const* ptr = glyphs_[j];
            do {
                out.push_back(*ptr++);
            } while (is_ext_byte(*ptr));
        }
    }

    bool decode(std::string& out, auto const& glyph, int row = 0) const {
        decode(out, glyph.bitmap(row * H));
        return (row + 1) * H < glyph.kHeight;
    }

    static bool is_ext_byte(uint8_t c) {
        return (0x80 <= c && c < 0xc0);
    }

  private:
    int context_width_ = W;
    int context_height_;
    uint64_t context_mask_;
    std::vector<char const*> glyphs_;
};

struct CharSetBase {
    virtual void insert(Codepoint code, Glyph const& glyph, bool replace = true) = 0;
    virtual bool decode(std::string& out, Glyph const& glyph, int row) const = 0;
    CharSetBase(std::string_view name) : name_(name) {}
    size_t count(Codepoint code) {
        return chars_.count(code);
    }
    virtual int get_rows() = 0;

    std::string_view get(Codepoint code) {
        if (count(code) == 0) return chars_[' '];
        return chars_[code];
    }
    auto begin() { return chars_.begin(); }
    auto end() { return chars_.end(); }

    std::string const name_;
    std::map<Codepoint, std::string> chars_;
};

template <int W, int H>
struct CharSet : public CharSetBase {
    CharSet(std::string_view name, Decoder<W, H> const& decoder)
        : CharSetBase(name), decoder_(decoder) { }

    void insert(Codepoint code, Glyph const& glyph, bool replace) override {
        if (replace == false && chars_.count(code)) return;
        std::string image;
        for (int row = 0; decoder_.decode(image, glyph, row); ++row) {
            image += "#\n";
        }
        image += "##\n";
        chars_[code] = image;
    }
    bool decode(std::string& out, Glyph const& glyph, int row) const override {
        return decoder_.decode(out, glyph, row);
    }
    int get_rows() override { return (Glyph::kHeight - 1) / H + 1; }

    Decoder<W, H> const& decoder_;
};


static constexpr char braille_data[] =
    "⠀⠁⠈⠉⠂⠃⠊⠋⠐⠑⠘⠙⠒⠓⠚⠛"
    "⠄⠅⠌⠍⠆⠇⠎⠏⠔⠕⠜⠝⠖⠗⠞⠟"
    "⠠⠡⠨⠩⠢⠣⠪⠫⠰⠱⠸⠹⠲⠳⠺⠻"
    "⠤⠥⠬⠭⠦⠧⠮⠯⠴⠵⠼⠽⠶⠷⠾⠿"
    "⡀⡁⡈⡉⡂⡃⡊⡋⡐⡑⡘⡙⡒⡓⡚⡛"
    "⡄⡅⡌⡍⡆⡇⡎⡏⡔⡕⡜⡝⡖⡗⡞⡟"
    "⡠⡡⡨⡩⡢⡣⡪⡫⡰⡱⡸⡹⡲⡳⡺⡻"
    "⡤⡥⡬⡭⡦⡧⡮⡯⡴⡵⡼⡽⡶⡷⡾⡿"
    "⢀⢁⢈⢉⢂⢃⢊⢋⢐⢑⢘⢙⢒⢓⢚⢛"
    "⢄⢅⢌⢍⢆⢇⢎⢏⢔⢕⢜⢝⢖⢗⢞⢟"
    "⢠⢡⢨⢩⢢⢣⢪⢫⢰⢱⢸⢹⢲⢳⢺⢻"
    "⢤⢥⢬⢭⢦⢧⢮⢯⢴⢵⢼⢽⢶⢷⢾⢿"
    "⣀⣁⣈⣉⣂⣃⣊⣋⣐⣑⣘⣙⣒⣓⣚⣛"
    "⣄⣅⣌⣍⣆⣇⣎⣏⣔⣕⣜⣝⣖⣗⣞⣟"
    "⣠⣡⣨⣩⣢⣣⣪⣫⣰⣱⣸⣹⣲⣳⣺⣻"
    "⣤⣥⣬⣭⣦⣧⣮⣯⣴⣵⣼⣽⣶⣷⣾⣿";

static constexpr char braille6_data[] =
    "⠀𜹑𜹒𜹓𜹔𜹕𜹖𜹗𜹘𜹙𜹚𜹛𜹜𜹝𜹞𜹟"
    "𜹠𜹡𜹢𜹣𜹤𜹥𜹦𜹧𜹨𜹩𜹪𜹫𜹬𜹭𜹮𜹯"
    "𜹰𜹱𜹲𜹳𜹴𜹵𜹶𜹷𜹸𜹹𜹺𜹻𜹼𜹽𜹾𜹿"
    "𜺀𜺁𜺂𜺃𜺄𜺅𜺆𜺇𜺈𜺉𜺊𜺋𜺌𜺍𜺎𜺏";

static constexpr char braille4_data[] =
    "⠀𜰡𜰢𜰣𜰤𜰥𜰦𜰧𜰨𜰩𜰪𜰫𜰬𜰭𜰮𜰯";

static constexpr char block_data[] =
    "⠀𜺨𜺫🮂𜴀▘𜴁𜴂𜴃𜴄▝𜴅𜴆𜴇𜴈▀"
    "𜴉𜴊𜴋𜴌🯦𜴍𜴎𜴏𜴐𜴑𜴒𜴓𜴔𜴕𜴖𜴗"
    "𜴘𜴙𜴚𜴛𜴜𜴝𜴞𜴟🯧𜴠𜴡𜴢𜴣𜴤𜴥𜴦"
    "𜴧𜴨𜴩𜴪𜴫𜴬𜴭𜴮𜴯𜴰𜴱𜴲𜴳𜴴𜴵🮅"
    "𜺣𜴶𜴷𜴸𜴹𜴺𜴻𜴼𜴽𜴾𜴿𜵀𜵁𜵂𜵃𜵄"
    "▖𜵅𜵆𜵇𜵈▌𜵉𜵊𜵋𜵌▞𜵍𜵎𜵏𜵐▛"
    "𜵑𜵒𜵓𜵔𜵕𜵖𜵗𜵘𜵙𜵚𜵛𜵜𜵝𜵞𜵟𜵠"
    "𜵡𜵢𜵣𜵤𜵥𜵦𜵧𜵨𜵩𜵪𜵫𜵬𜵭𜵮𜵯𜵰"
    "𜺠𜵱𜵲𜵳𜵴𜵵𜵶𜵷𜵸𜵹𜵺𜵻𜵼𜵽𜵾𜵿"
    "𜶀𜶁𜶂𜶃𜶄𜶅𜶆𜶇𜶈𜶉𜶊𜶋𜶌𜶍𜶎𜶏"
    "▗𜶐𜶑𜶒𜶓▚𜶔𜶕𜶖𜶗▐𜶘𜶙𜶚𜶛▜"
    "𜶜𜶝𜶞𜶟𜶠𜶡𜶢𜶣𜶤𜶥𜶦𜶧𜶨𜶩𜶪𜶫"
    "▂𜶬𜶭𜶮𜶯𜶰𜶱𜶲𜶳𜶴𜶵𜶶𜶷𜶸𜶹𜶺"
    "𜶻𜶼𜶽𜶾𜶿𜷀𜷁𜷂𜷃𜷄𜷅𜷆𜷇𜷈𜷉𜷊"
    "𜷋𜷌𜷍𜷎𜷏𜷐𜷑𜷒𜷓𜷔𜷕𜷖𜷗𜷘𜷙𜷚"
    "▄𜷛𜷜𜷝𜷞▙𜷟𜷠𜷡𜷢▟𜷣▆𜷤𜷥█";

static constexpr char block6_data[] =
    "⠀🬀🬁🬂🬃🬄🬅🬆🬇🬈🬉🬊🬋🬌🬍🬎"
    "🬏🬐🬑🬒🬓▌🬔🬕🬖🬗🬘🬙🬚🬛🬜🬝"
    "🬞🬟🬠🬡🬢🬣🬤🬥🬦🬧▐🬨🬩🬪🬫🬬"
    "🬭🬮🬯🬰🬱🬲🬳🬴🬵🬶🬷🬸🬹🬺🬻█";

static constexpr char block4_data[] =
    "⠀▘▝▀▖▌▞▛▗▚▐▜▄▙▟█";

static constexpr char block2_data[] =
    "⠀▀▄█";

const Decoder<2,4> braille(braille_data);
const Decoder<2,3> braille6(braille6_data);
const Decoder<2,2> braille4(braille4_data);
const Decoder<2,4> block(block_data);
const Decoder<2,3> block6(block6_data);
const Decoder<2,2> block4(block4_data);
const Decoder<1,2> block2(block2_data);

CharSet<2,4> dots2x4("2x4dot", braille);
CharSet<2,3> dots2x3("2x3dot", braille6);
CharSet<2,2> dots2x2("2x2dot", braille4);
CharSet<2,4> blocks2x4("2x4block", block);
CharSet<2,3> blocks2x3("2x3block", block6);
CharSet<2,2> blocks2x2("2x2block", block4);
CharSet<1,2> blocks1x2("1x2block", block2);

CharSetBase* allsets[] = {
    &dots2x4,
    &dots2x3,
    &dots2x2,
    &blocks2x4,
    &blocks2x3,
    &blocks2x2,
    &blocks1x2,
};

int main(int argc, char** argv) {
    std::string source = "c64";
    Codepoint code = 32;
    int opt;
    while ((opt = getopt(argc, argv, "i:")) != -1) {
        switch (opt) {
        case 'i': source = optarg;
            break;
        default:
            std::cerr << "oops, bad command line argument." << std::endl;
            exit(EXIT_FAILURE);
        }
    }

    std::string filename = source + ".bin";
    FILE* blob = fopen(filename.c_str(), "rb");
    if (blob == nullptr) {
        perror(filename.c_str());
        exit(EXIT_FAILURE);
    }
    filename = source + ".map";
    FILE* map = fopen(filename.c_str(), "rt");

    Glyph glyph;
    while (fread(&glyph, sizeof(glyph), 1, blob) == 1) {
        glyph.hflip();
        if (map != nullptr) {
            char metadata[1024];
            fgets(metadata, sizeof(metadata), map);
            if (metadata[0] == 'U' && metadata[1] == '+') {
                code = strtoull(metadata + 2, nullptr, 16);
            } else {
                code = 0;
            }
        }
        if (code > 0) {
            for (auto set : allsets) {
                set->insert(code, glyph);
            }
        } else {
            std::string output;
            bool more = true;
            for (int row = 0; more == true; ++row) {
                more = false;
                for (auto set : allsets) {
                    more |= set->decode(output, glyph, row);
                    output += "  ";
                }
                if (more) output += '\n';
            }
            std::cout << "No mapping for:\n" << output << std::endl;
        }
        code++;
    }
    for (auto set : allsets) {
        filename = source + "_" + set->name_ + ".tlf";
        FILE* font = fopen(filename.c_str(), "wt");
        if (font == nullptr) {
            perror(filename.c_str());
            continue;
        }
        fprintf(font, "tlf2a$ %d %d 40 -1 1 0 0 0\n"
                      "# %s %s generated by %s\n",
                      set->get_rows(), set->get_rows(), source.c_str(), set->name_.c_str(), argv[0]);

        for (Codepoint code = 32; code < 127; ++code) {
            auto s = set->get(code);
            fwrite(s.data(), 1, s.size(), font);
        }
        for (Codepoint code : { 0x00C4, 0x00D6, 0x00DC, 0x00E4, 0x00F6, 0x00FC, 0x00DF, }) {
            auto s = set->get(code);
            fwrite(s.data(), 1, s.size(), font);
        }

        for (auto it : *set) {
            if (it.first < 127 || it.first == 0x00C4 || it.first == 0x00D6 || it.first == 0x00DC
                 || it.first == 0x00E4 || it.first == 0x00F6 || it.first == 0x00FC || it.first == 0x00DF) {
                continue;
            }
            fprintf(font, "0x%06x\n%.*s", it.first, int(it.second.size()), it.second.data());
        }
        fclose(font);
    }
    if (blob != nullptr) fclose(blob);
    if (map != nullptr) fclose(map);
    return 0;
}
