#include <cassert>
#include <cstdio>
#include <cstdint>
#include <string>
#include <vector>
#include <fstream>
#include <iostream>
#include <iomanip>


/*
░─░━░│░┃░┄░┅░┆░┇░┈░┉░┊░┋░┌░┍░┎░┏░┐░┑░┒░┓░└░┕░┖░┗░┘░┙░┚░┛░├░┝░┞░┟░░
░░┠░┡░┢░┣░┤░┥░┦░┧░┨░┩░┪░┫░┬░┭░┮░┯░┰░┱░┲░┳░┴░┵░┶░┷░┸░┹░┺░┻░┼░┽░┾░┿░
░╀░╁░╂░╃░╄░╅░╆░╇░╈░╉░╊░╋░╌░╍░╎░╏░═░║░╒░╓░╔░╕░╖░╗░╘░╙░╚░╛░╜░╝░╞░╟░░
░░╠░╡░╢░╣░╤░╥░╦░╧░╨░╩░╪░╫░╬░╭░╮░╯░╰░╱░╲░╳░╴░╵░╶░╷░╸░╹░╺░╻░╼░╽░╾░╿░
░▀░▁░▂░▃░▄░▅░▆░▇░█░▉░▊░▋░▌░▍░▎░▏░▐░░░▒░▓░▔░▕░▖░▗░▘░▙░▚░▛░▜░▝░▞░▟░░
░░🬀░🬁░🬂░🬃░🬄░🬅░🬆░🬇░🬈░🬉░🬊░🬋░🬌░🬍░🬎░🬏░🬐░🬑░🬒░🬓░🬔░🬕░🬖░🬗░🬘░🬙░🬚░🬛░🬜░🬝░🬞░🬟░
░🬠░🬡░🬢░🬣░🬤░🬥░🬦░🬧░🬨░🬩░🬪░🬫░🬬░🬭░🬮░🬯░🬰░🬱░🬲░🬳░🬴░🬵░🬶░🬷░🬸░🬹░🬺░🬻░🬼░🬽░🬾░🬿░░
░░🭀░🭁░🭂░🭃░🭄░🭅░🭆░🭇░🭈░🭉░🭊░🭋░🭌░🭍░🭎░🭏░🭐░🭑░🭒░🭓░🭔░🭕░🭖░🭗░🭘░🭙░🭚░🭛░🭜░🭝░🭞░🭟░
░🭠░🭡░🭢░🭣░🭤░🭥░🭦░🭧░🭨░🭩░🭪░🭫░🭬░🭭░🭮░🭯░🭰░🭱░🭲░🭳░🭴░🭵░🭶░🭷░🭸░🭹░🭺░🭻░🭼░🭽░🭾░🭿░░
░░🮀░🮁░🮂░🮃░🮄░🮅░🮆░🮇░🮈░🮉░🮊░🮋░🮌░🮍░🮎░🮏░🮐░🮑░🮒░🮔░🮕░🮖░🮗░🮘░🮙░🮚░🮛░🮜░🮝░🮞░🮟░░░
░🮠░🮡░🮢░🮣░🮤░🮥░🮦░🮧░🮨░🮩░🮪░🮫░🮬░🮭░🮮░🮯░🮰░🮱░🮲░🮳░🮴░🮵░🮶░🮷░🮸░🮹░🮺░🮻░🮼░🮽░🮾░🮿░░
░░🯀░🯁░🯂░🯃░🯄░🯅░🯆░🯇░🯈░🯉░🯊░🯋░🯌░🯍░🯎░🯏░🯐░🯑░🯒░🯓░🯔░🯕░🯖░🯗░🯘░🯙░🯚░🯛░🯜░🯝░🯞░🯟░
░🯠░🯡░🯢░🯣░🯤░🯥░🯦░🯧░🯨░🯩░🯪░🯫░🯬░🯭░🯮░🯯░🯰░🯱░🯲░🯳░🯴░🯵░🯶░🯷░🯸░🯹░🯺░░░░░░░░░░░░
░░𜰀░𜰁░𜰂░𜰃░𜰄░𜰅░𜰆░𜰇░𜰈░𜰉░𜰊░𜰋░𜰌░𜰍░𜰎░𜰏░𜰐░𜰑░𜰒░𜰓░𜰔░𜰕░𜰖░𜰗░𜰘░𜰙░𜰚░𜰛░𜰜░𜰝░𜰞░𜰟░
░𜰠░𜰡░𜰢░𜰣░𜰤░𜰥░𜰦░𜰧░𜰨░𜰩░𜰪░𜰫░𜰬░𜰭░𜰮░𜰯░𜰰░𜰱░𜰲░𜰳░𜰴░𜰵░𜰶░𜰷░𜰸░𜰹░𜰺░𜰻░𜰼░𜰽░𜰾░𜰿░░
░░𜱀░𜱁░𜱂░𜱃░𜱄░𜱅░𜱆░𜱇░𜱈░𜱉░𜱊░𜱋░𜱌░𜱍░𜱎░𜱏░𜱐░𜱑░𜱒░𜱓░𜱔░𜱕░𜱖░𜱗░𜱘░𜱙░𜱚░𜱛░𜱜░𜱝░𜱞░𜱟░
░𜱠░𜱡░𜱢░𜱣░𜱤░𜱥░𜱦░𜱧░𜱨░𜱩░𜱪░𜱫░𜱬░𜱭░𜱮░𜱯░𜱰░𜱱░𜱲░𜱳░𜱴░𜱵░𜱶░𜱷░𜱸░𜱹░𜱺░𜱻░𜱼░𜱽░𜱾░𜱿░░
░░𜲀░𜲁░𜲂░𜲃░𜲄░𜲅░𜲆░𜲇░𜲈░𜲉░𜲊░𜲋░𜲌░𜲍░𜲎░𜲏░𜲐░𜲑░𜲒░𜲓░𜲔░𜲕░𜲖░𜲗░𜲘░𜲙░𜲚░𜲛░𜲜░𜲝░𜲞░𜲟░
░𜲠░𜲡░𜲢░𜲣░𜲤░𜲥░𜲦░𜲧░𜲨░𜲩░𜲪░𜲫░𜲬░𜲭░𜲮░𜲯░𜲰░𜲱░𜲲░𜲳░𜲴░𜲵░𜲶░𜲷░𜲸░𜲹░𜲺░𜲻░𜲼░𜲽░𜲾░𜲿░░
░░𜳀░𜳁░𜳂░𜳃░𜳄░𜳅░𜳆░𜳇░𜳈░𜳉░𜳊░𜳋░𜳌░𜳍░𜳎░𜳏░𜳐░𜳑░𜳒░𜳓░𜳔░𜳕░𜳖░𜳗░𜳘░𜳙░𜳚░𜳛░𜳜░𜳝░𜳞░𜳟░
░𜳠░𜳡░𜳢░𜳣░𜳤░𜳥░𜳦░𜳧░𜳨░𜳩░𜳪░𜳫░𜳬░𜳭░𜳮░𜳯░𜳰░𜳱░𜳲░𜳳░𜳴░𜳵░𜳶░𜳷░𜳸░𜳹░𜳺░𜳻░𜳼░░░░░░░░
░░𜴀░𜴁░𜴂░𜴃░𜴄░𜴅░𜴆░𜴇░𜴈░𜴉░𜴊░𜴋░𜴌░𜴍░𜴎░𜴏░𜴐░𜴑░𜴒░𜴓░𜴔░𜴕░𜴖░𜴗░𜴘░𜴙░𜴚░𜴛░𜴜░𜴝░𜴞░𜴟░
░𜴠░𜴡░𜴢░𜴣░𜴤░𜴥░𜴦░𜴧░𜴨░𜴩░𜴪░𜴫░𜴬░𜴭░𜴮░𜴯░𜴰░𜴱░𜴲░𜴳░𜴴░𜴵░𜴶░𜴷░𜴸░𜴹░𜴺░𜴻░𜴼░𜴽░𜴾░𜴿░░
░░𜵀░𜵁░𜵂░𜵃░𜵄░𜵅░𜵆░𜵇░𜵈░𜵉░𜵊░𜵋░𜵌░𜵍░𜵎░𜵏░𜵐░𜵑░𜵒░𜵓░𜵔░𜵕░𜵖░𜵗░𜵘░𜵙░𜵚░𜵛░𜵜░𜵝░𜵞░𜵟░
░𜵠░𜵡░𜵢░𜵣░𜵤░𜵥░𜵦░𜵧░𜵨░𜵩░𜵪░𜵫░𜵬░𜵭░𜵮░𜵯░𜵰░𜵱░𜵲░𜵳░𜵴░𜵵░𜵶░𜵷░𜵸░𜵹░𜵺░𜵻░𜵼░𜵽░𜵾░𜵿░░
░░𜶀░𜶁░𜶂░𜶃░𜶄░𜶅░𜶆░𜶇░𜶈░𜶉░𜶊░𜶋░𜶌░𜶍░𜶎░𜶏░𜶐░𜶑░𜶒░𜶓░𜶔░𜶕░𜶖░𜶗░𜶘░𜶙░𜶚░𜶛░𜶜░𜶝░𜶞░𜶟░
░𜶠░𜶡░𜶢░𜶣░𜶤░𜶥░𜶦░𜶧░𜶨░𜶩░𜶪░𜶫░𜶬░𜶭░𜶮░𜶯░𜶰░𜶱░𜶲░𜶳░𜶴░𜶵░𜶶░𜶷░𜶸░𜶹░𜶺░𜶻░𜶼░𜶽░𜶾░𜶿░░
░░𜷀░𜷁░𜷂░𜷃░𜷄░𜷅░𜷆░𜷇░𜷈░𜷉░𜷊░𜷋░𜷌░𜷍░𜷎░𜷏░𜷐░𜷑░𜷒░𜷓░𜷔░𜷕░𜷖░𜷗░𜷘░𜷙░𜷚░𜷛░𜷜░𜷝░𜷞░𜷟░
░𜷠░𜷡░𜷢░𜷣░𜷤░𜷥░𜷦░𜷧░𜷨░𜷩░𜷪░𜷫░𜷬░𜷭░𜷮░𜷯░𜷰░𜷱░𜷲░𜷳░𜷴░𜷵░𜷶░𜷷░𜷸░𜷹░𜷺░𜷻░𜷼░𜷽░𜷾░𜷿░░
░░𜸀░𜸁░𜸂░𜸃░𜸄░𜸅░𜸆░𜸇░𜸈░𜸉░𜸊░𜸋░𜸌░𜸍░𜸎░𜸏░𜸐░𜸑░𜸒░𜸓░𜸔░𜸕░𜸖░𜸗░𜸘░𜸙░𜸚░𜸛░𜸜░𜸝░𜸞░𜸟░
░𜸠░𜸡░𜸢░𜸣░𜸤░𜸥░𜸦░𜸧░𜸨░𜸩░𜸪░𜸫░𜸬░𜸭░𜸮░𜸯░𜸰░𜸱░𜸲░𜸳░𜸴░𜸵░𜸶░𜸷░𜸸░𜸹░𜸺░𜸻░𜸼░𜸽░𜸾░𜸿░░
░░𜹀░𜹁░𜹂░𜹃░𜹄░𜹅░𜹆░𜹇░𜹈░𜹉░𜹊░𜹋░𜹌░𜹍░𜹎░𜹏░𜹐░𜹑░𜹒░𜹓░𜹔░𜹕░𜹖░𜹗░𜹘░𜹙░𜹚░𜹛░𜹜░𜹝░𜹞░𜹟░
░𜹠░𜹡░𜹢░𜹣░𜹤░𜹥░𜹦░𜹧░𜹨░𜹩░𜹪░𜹫░𜹬░𜹭░𜹮░𜹯░𜹰░𜹱░𜹲░𜹳░𜹴░𜹵░𜹶░𜹷░𜹸░𜹹░𜹺░𜹻░𜹼░𜹽░𜹾░𜹿░░
░░𜺀░𜺁░𜺂░𜺃░𜺄░𜺅░𜺆░𜺇░𜺈░𜺉░𜺊░𜺋░𜺌░𜺍░𜺎░𜺏░𜺐░𜺑░𜺒░𜺓░𜺔░𜺕░𜺖░𜺗░𜺘░𜺙░𜺚░𜺛░𜺜░𜺝░𜺞░𜺟░
░𜺠░𜺡░𜺢░𜺣░𜺤░𜺥░𜺦░𜺧░𜺨░𜺩░𜺪░𜺫░𜺬░𜺭░𜺮░𜺯░𜺰░𜺱░𜺲░𜺳░𜺺░𜺻░𜺼░𜺽░𜺾░𜺿░
*/

template <size_t N = 8>
struct Glyph {
    static constexpr int kWidth = 8;
    static constexpr int kHeight = N;
    uint64_t bitmap(int row = 0) const {
        uint64_t r = 0;
        for (int i = 0; i < 64 / kWidth; ++i) {
            int j = i + row;
            if (0 <= j && j < int(N)) {
                r |= uint64_t(blob_[j]) << (i * kWidth);
            }
        }
        return r;
    }
    void hflip() {
        for (size_t i = 0; i < N; ++i) {
            int x = blob_[i];
            x = ((x >> 1) & 0x5555555555555555) | ((x & 0x5555555555555555) << 1);
            x = ((x >> 2) & 0x3333333333333333) | ((x & 0x3333333333333333) << 2);
            x = ((x >> 4) & 0x0f0f0f0f0f0f0f0f) | ((x & 0x0f0f0f0f0f0f0f0f) << 4);
            blob_[i] = x;
        }
    }

    uint8_t blob_[N];
};

struct DecoderBase {
    // TODO: whatever
};

template <size_t W, size_t H>
struct Decoder : public DecoderBase {
    Decoder(char const* ptr) {
        while (*ptr != '\0') {
            uint8_t byte = *ptr;
            if (!is_ext_byte(byte)) {
                glyphs_.push_back(ptr);
            }
            ptr++;
        }
        context_height_ = 0;
        int context_size;
        // TODO: determine context_width_;
        do {
            context_height_++;
            context_size = context_width_ * context_height_;
        } while ((glyphs_.size() >> context_size) > 1);
        context_mask_ = ~(~uint64_t(1) << (context_width_ - 1));
        // std::cout << glyphs_.size() << " " << W << "x" << H << "  "
        //           << context_width_ << "," << context_height_ << "  " << context_mask_ << std::endl;
    }

    template <int GW>
    void decode(std::string& out, uint64_t bitmap) const {
        for (int x = 0; x < GW; x += W) {
            int j = 0;
            uint64_t mask = context_mask_;
            int shift = 0;
            for (int y = 0; y < context_height_; ++y) {
                j |= (bitmap >> shift) & mask;
                mask <<= context_width_;
                shift += GW - context_width_;
            }
            bitmap >>= W;
            assert(0 <= j && j < int(glyphs_.size()));
            char const* ptr = glyphs_[j];
            do {
                out.push_back(*ptr++);
            } while (is_ext_byte(*ptr));
        }
    }

    bool decode(std::string& out, auto const& glyph, int row = 0) const {
        decode<glyph.kWidth>(out, glyph.bitmap(row * H));
        return (row + 1) * H < glyph.kHeight;
    }

    static bool is_ext_byte(uint8_t c) {
        return (0x80 <= c && c < 0xc0);
    }

  private:
    int context_width_ = W;
    int context_height_;
    uint64_t context_mask_;
    std::vector<char const*> glyphs_;
};


static constexpr char braille_data[] =
    "⠀⠁⠈⠉⠂⠃⠊⠋⠐⠑⠘⠙⠒⠓⠚⠛"
    "⠄⠅⠌⠍⠆⠇⠎⠏⠔⠕⠜⠝⠖⠗⠞⠟"
    "⠠⠡⠨⠩⠢⠣⠪⠫⠰⠱⠸⠹⠲⠳⠺⠻"
    "⠤⠥⠬⠭⠦⠧⠮⠯⠴⠵⠼⠽⠶⠷⠾⠿"
    "⡀⡁⡈⡉⡂⡃⡊⡋⡐⡑⡘⡙⡒⡓⡚⡛"
    "⡄⡅⡌⡍⡆⡇⡎⡏⡔⡕⡜⡝⡖⡗⡞⡟"
    "⡠⡡⡨⡩⡢⡣⡪⡫⡰⡱⡸⡹⡲⡳⡺⡻"
    "⡤⡥⡬⡭⡦⡧⡮⡯⡴⡵⡼⡽⡶⡷⡾⡿"
    "⢀⢁⢈⢉⢂⢃⢊⢋⢐⢑⢘⢙⢒⢓⢚⢛"
    "⢄⢅⢌⢍⢆⢇⢎⢏⢔⢕⢜⢝⢖⢗⢞⢟"
    "⢠⢡⢨⢩⢢⢣⢪⢫⢰⢱⢸⢹⢲⢳⢺⢻"
    "⢤⢥⢬⢭⢦⢧⢮⢯⢴⢵⢼⢽⢶⢷⢾⢿"
    "⣀⣁⣈⣉⣂⣃⣊⣋⣐⣑⣘⣙⣒⣓⣚⣛"
    "⣄⣅⣌⣍⣆⣇⣎⣏⣔⣕⣜⣝⣖⣗⣞⣟"
    "⣠⣡⣨⣩⣢⣣⣪⣫⣰⣱⣸⣹⣲⣳⣺⣻"
    "⣤⣥⣬⣭⣦⣧⣮⣯⣴⣵⣼⣽⣶⣷⣾⣿";

static constexpr char braille6_data[] =
    "⠀𜹑𜹒𜹓𜹔𜹕𜹖𜹗𜹘𜹙𜹚𜹛𜹜𜹝𜹞𜹟"
    "𜹠𜹡𜹢𜹣𜹤𜹥𜹦𜹧𜹨𜹩𜹪𜹫𜹬𜹭𜹮𜹯"
    "𜹰𜹱𜹲𜹳𜹴𜹵𜹶𜹷𜹸𜹹𜹺𜹻𜹼𜹽𜹾𜹿"
    "𜺀𜺁𜺂𜺃𜺄𜺅𜺆𜺇𜺈𜺉𜺊𜺋𜺌𜺍𜺎𜺏";

static constexpr char braille4_data[] =
    "⠀𜰡𜰢𜰣𜰤𜰥𜰦𜰧𜰨𜰩𜰪𜰫𜰬𜰭𜰮𜰯";

static constexpr char block_data[] =
    "⠀𜺨𜺫🮂𜴀▘𜴁𜴂𜴃𜴄▝𜴅𜴆𜴇𜴈▀"
    "𜴉𜴊𜴋𜴌🯦𜴍𜴎𜴏𜴐𜴑𜴒𜴓𜴔𜴕𜴖𜴗"
    "𜴘𜴙𜴚𜴛𜴜𜴝𜴞𜴟🯧𜴠𜴡𜴢𜴣𜴤𜴥𜴦"
    "𜴧𜴨𜴩𜴪𜴫𜴬𜴭𜴮𜴯𜴰𜴱𜴲𜴳𜴴𜴵🮅"
    "𜺣𜴶𜴷𜴸𜴹𜴺𜴻𜴼𜴽𜴾𜴿𜵀𜵁𜵂𜵃𜵄"
    "▖𜵅𜵆𜵇𜵈▌𜵉𜵊𜵋𜵌▞𜵍𜵎𜵏𜵐▛"
    "𜵑𜵒𜵓𜵔𜵕𜵖𜵗𜵘𜵙𜵚𜵛𜵜𜵝𜵞𜵟𜵠"
    "𜵡𜵢𜵣𜵤𜵥𜵦𜵧𜵨𜵩𜵪𜵫𜵬𜵭𜵮𜵯𜵰"
    "𜺠𜵱𜵲𜵳𜵴𜵵𜵶𜵷𜵸𜵹𜵺𜵻𜵼𜵽𜵾𜵿"
    "𜶀𜶁𜶂𜶃𜶄𜶅𜶆𜶇𜶈𜶉𜶊𜶋𜶌𜶍𜶎𜶏"
    "▗𜶐𜶑𜶒𜶓▚𜶔𜶕𜶖𜶗▐𜶘𜶙𜶚𜶛▜"
    "𜶜𜶝𜶞𜶟𜶠𜶡𜶢𜶣𜶤𜶥𜶦𜶧𜶨𜶩𜶪𜶫"
    "▂𜶬𜶭𜶮𜶯𜶰𜶱𜶲𜶳𜶴𜶵𜶶𜶷𜶸𜶹𜶺"
    "𜶻𜶼𜶽𜶾𜶿𜷀𜷁𜷂𜷃𜷄𜷅𜷆𜷇𜷈𜷉𜷊"
    "𜷋𜷌𜷍𜷎𜷏𜷐𜷑𜷒𜷓𜷔𜷕𜷖𜷗𜷘𜷙𜷚"
    "▄𜷛𜷜𜷝𜷞▙𜷟𜷠𜷡𜷢▟𜷣▆𜷤𜷥█";

static constexpr char block6_data[] =
    "⠀🬀🬁🬂🬃🬄🬅🬆🬇🬈🬉🬊🬋🬌🬍🬎"
    "🬏🬐🬑🬒🬓▌🬔🬕🬖🬗🬘🬙🬚🬛🬜🬝"
    "🬞🬟🬠🬡🬢🬣🬤🬥🬦🬧▐🬨🬩🬪🬫🬬"
    "🬭🬮🬯🬰🬱🬲🬳🬴🬵🬶🬷🬸🬹🬺🬻█";

static constexpr char block4_data[] =
    "⠀▘▝▀▖▌▞▛▗▚▐▜▄▙▟█";

static constexpr char block2_data[] =
    "⠀▀▄█";

const Decoder<2,4> braille(braille_data);
const Decoder<2,4> block(block_data);
const Decoder<2,3> braille6(braille6_data);
const Decoder<2,3> block6(block6_data);
const Decoder<2,2> braille4(braille4_data);
const Decoder<2,2> block4(block4_data);
const Decoder<1,2> block2(block2_data);

int main(void) {
    std::ifstream mapping;
    mapping.open("petscii.txt");
    Glyph<8> glyph;
    std::cout << std::endl;
    while (fread(&glyph, sizeof(glyph), 1, stdin) == 1) {
        glyph.hflip();
        std::string metadata;
        getline(mapping, metadata);
        std::cout << metadata << std::endl;
        std::string output;
        bool more = true;
        for (int row = 0; more == true; ++row) {
            output.clear();
            more = false;
            more |= block.decode(output, glyph, row);
            output += "  ";
            more |= braille.decode(output, glyph, row);
            output += "  ";
            more |= block6.decode(output, glyph, row);
            output += "  ";
            more |= braille6.decode(output, glyph, row);
            output += "  ";
            more |= block4.decode(output, glyph, row);
            output += "  ";
            more |= braille4.decode(output, glyph, row);
            output += "  ";
            more |= block2.decode(output, glyph, row);
            std::cout << output << std::endl;
        }
    }
    return 0;
}
